weird_mglndd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-23 五 14:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Something About MGLNDD Scans</title>
<meta name="author" content="dongdigua" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='css/main.css' />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./../"> UP </a>
 |
 <a accesskey="H" href="https://dongdigua.github.io"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Something About MGLNDD Scans</h1>

<div id="outline-container-org3afb71e" class="outline-2">
<h2 id="org3afb71e"><span class="section-number-2">1.</span> <a href="https://stretchoid.com/">stretchoid opt-out</a></h2>
<div class="outline-text-2" id="text-1">
<p>
it's this domain's workers that COMSTANTLY scanning the WHOLE internet<br />
</p>
</div>
</div>
<div id="outline-container-orgc72968d" class="outline-2">
<h2 id="orgc72968d"><span class="section-number-2">2.</span> <a href="https://isc.sans.edu/diary/MGLNDD_%2A+Scans/28458">SANS internet storm center diary</a></h2>
<div class="outline-text-2" id="text-2">
<p>
about the scanner and IP range<br />
</p>
</div>
<div id="outline-container-orgc738e38" class="outline-3">
<h3 id="orgc738e38"><span class="section-number-3">2.1.</span> <a href="https://cybersafenv.org/2022/03/20/mglndd-scans-sun-mar-20th/">repost on cybersafenv</a></h3>
</div>
</div>
<div id="outline-container-org341b79a" class="outline-2">
<h2 id="org341b79a"><span class="section-number-2">3.</span> <a href="http://www.hackdig.com/04/hack-81133.htm">知名网络空间普查与网络测绘组织研究报告 第一期-组织名录篇</a></h2>
</div>
<div id="outline-container-orgd8581cc" class="outline-2">
<h2 id="orgd8581cc"><span class="section-number-2">4.</span> <a href="https://duanmofan.com/archives/librarymanagementsystem">【水蓝石】 近日图书馆出入人员信息逸事和小恶魔创造【持续更新】</a></h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<p>
博客主评价，有很多包括stretchoid.com的组织，有的是把自己伪装成科研实验用数据，并没有恶意，有的是什么理由也不给，只是不停地扫描全网的网站。<br />
其中也包括像密歇根大学，加州大学伯克利分校的访问信息。因为网络安全领域没有类似于“希波克拉底誓言”的东西，所以不能像医生一样信任<br />
就像到处晃别人家的门把手而不打开不是犯罪，但是真正的打开就混在发现没有锁门，而晃门把手时。<br />
</p>
</blockquote>
</div>
<div id="outline-container-orgdd5ef89" class="outline-4">
<h4 id="orgdd5ef89"><span class="section-number-4">4.0.1.</span> <a href="https://www.hackerfactor.com/blog/index.php?/archives/775-Scans-and-Attacks.html">HackerFactor: Scans &amp; Attacks</a></h4>
</div>
</div>
<div id="outline-container-org639d326" class="outline-2">
<h2 id="org639d326"><span class="section-number-2">5.</span> <a href="https://github.com/dongdigua/portscan-listener/blob/main/log/some_strange_logs.md">my listener and some other logs</a></h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd4cfe7b" class="outline-3">
<h3 id="orgd4cfe7b"><span class="section-number-3">5.1.</span> <a href="https://www.bilibili.com/read/cv16357621">my post on bilibili</a></h3>
</div>
</div>
<div id="outline-container-orge8c93a7" class="outline-2">
<h2 id="orge8c93a7"><span class="section-number-2">6.</span> <a href="https://zhuanlan.zhihu.com/p/67186794">zhihu:repost-translation: 如何建立一个基本的蜜罐</a></h2>
<div class="outline-text-2" id="text-6">
<p>
the original post is gone<br />
</p>
<blockquote>
<p>
您还可以开始执行DNS和WHOIS查找，以找出每次扫描背后的人员。<br />
在这个简短的样本中，我找到了一个伪“研究员”：107.170.202.111解析为“zg-0301f-15.stretchoid.com”。<br />
他们没有确定他们正在做什么或为什么他们在161 / udp扫描我的蜜罐。（端口161 / udp是为简单的网络管理协议（SNMP）保留的，并且经常容易受到攻击。）<br />
是的，他们把“malicious”拼错了 - 因此它可能不会出现在谷歌搜索“stretchoid and malicious”的结果中。<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org425aa2c" class="outline-2">
<h2 id="org425aa2c"><span class="section-number-2">7.</span> <a href="https://www.digitalocean.com/community/questions/why-is-digital-ocean-showing-in-my-router-connecting-to-a-ps4">Why is Digital Ocean showing in my router, connecting to a PS4?</a></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-08-17 三 00:00</p>
<p class="author">Author: dongdigua</p>
<p class="date">Created: 2022-09-23 五 14:51</p>
</div>
</body>
</html>
